Catalogs/ДоговорыВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДоговорыВзаиморасчетов</Name>
			<Comment>Договоры взаиморасчетов</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоЗакрытиеСделок</Name>
					<Comment>Значение по умолчанию для аналогичного флага в документах, влияющих на взаиморасчеты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Comment>Определяет валюту взаиморасчетов по договору, не может меняться, если по договору проведен хотя бы один документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Comment>Вид договора с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Comment>Вид оплаты по договору</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания учета по договору</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала учета по договору</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйКредит</Name>
					<Comment>Максимальная сумма кредита (долга) по договору</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Comment>Номер договора с контрагентом</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, заключившая договор с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПроект</Name>
					<Comment>Основной проект договора взаиморасчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСкидкиНаценкиРабот</Name>
					<Comment>Тип скидки наценки на работы по умолчанию для оформления продаж по данному договору</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение, заключившее договор с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСуммыКомиссии</Name>
					<Comment>0 -  комиссионное вознаграждение берется процентом, 1 - берется фиксированной суммой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссионногоВознаграждения</Name>
					<Comment>Процент комиссионного вознаграждения для договоров комиссии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссионногоВознаграждения</Name>
					<Comment>Сумма комиссионного вознаграждения для договоров комиссии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПредоплаты</Name>
					<Comment>% предоплаты по договору</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплатыЗадолженности</Name>
					<Comment>Срок оплаты задолженности (в днях)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСкидкиНаценки</Name>
					<Comment>Тип скидки наценки по умолчанию для оформлению продаж по данному договору</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенПокупки</Name>
					<Comment>Тип цен по умолчанию для оформления покупок по данному договору</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенПродажи</Name>
					<Comment>Тип цен по умолчанию для оформлению продаж по данному договору</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенРабот</Name>
					<Comment>Тип цен работ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияОтчетНаОснованииПродаж</Name>
					<Comment>Комиссия отчет на основании продаж</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПКП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляПерепродаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляАвтомобилей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляЗаказНарядов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляЗапчастей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляАвтосервиса</Name>
					<Comment>Договор по оказанию услуг автосервиса и работе с запчастями</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляАвтосалона</Name>
					<Comment>Договор используется для автосалона</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Внутренний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговора</Name>
					<Comment>Тип договора</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаКонтроляСуммыКредита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГосударственногоКонтракта</Name>
					<Comment>Идентификатор государственного контракта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Comment>Статья движения ден. средств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГосКонтракта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УФК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКонтракт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКонтракта</Name>
					<Comment>Сумма контракта</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакАгента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиАгента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияАвтоработВПечатныхФормах</Name>
					<Comment>Единица измерения авторабот в печатных формах</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницаИзмеренияАвтоработВПечатныхФормах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСоздаватьСчетФактуруАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгосрочный</Name>
					<Comment>При включенном флажке договоры не будут автоматически создаваться по каждому документу отгрузки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора1</Name>
					<Comment>Номер договора с контрагентом</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляПерепродажАвтомобилей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляПервичныхДокументов</Name>
					<Comment>При включенном флажке договоры будут использоваться в РЛ для комиссионного вознаграждения и в ЗН по гарантии</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
			<Comment>Типы договоров</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВиртуальныйДоговор</Name>
					<Comment>Виртуальный договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
					<Comment>Договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приложение</Name>
					<Comment>Приложение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДоговорыВзаиморасчетов/Ext/ManagerModule.bsl
//Бондаренко++ 20210923
Функция СМГ_СоздатьДоговор(ТекКонтрагент,ТекОрганизация,ТекПодразделениеКомпании,ТекНомер,ТекДата,ТекТипЗНЧДокумент) Экспорт
  	
	НовДог = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
  	УстановитьПривилегированныйРежим(Истина);
   	
	НовДог = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
	НовДог.УстановитьНовыйКод();
	НовДог.ТипЦенПродажи = Справочники.ТипыЦен.НайтиПоКоду("ЦБ000032");
	НовДог.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
	НовДог.НомерДоговора = СокрЛП(ТекНомер);	
 	НовДог.ВидДоговора=Перечисления.ВидыДоговоров.Продажа;
	НовДог.Владелец = ТекКонтрагент;
 	НовДог.Организация = ТекОрганизация;
	НовДог.Подразделение = ТекПодразделениеКомпании;
 	НовДог.НомерДоговора = ТекНомер;
	
	//Бондаренко++ 20220524
	Если НЕ ТекДата = Дата(1,1,1) Тогда
		НовДог.ДатаНачала = ТекДата;
	Иначе	
		НовДог.ДатаНачала = ТекущаяДата();	
	КонецЕсли;             
	//Бондаренко-- 20220524
	 
	Если ТекТипЗНЧДокумент = Тип("ДокументОбъект.ЗаказНаАвтомобиль") Тогда
    	ЧастьНаименования = "Договор продажи транспортного средства";
		НовДог.ДляАвтосалона = Истина;
	ИначеЕсли ТекТипЗНЧДокумент = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
      	ЧастьНаименования = "Договор продажи";		
		НовДог.ДляАвтосервиса = Истина;
	ИначеЕсли ТекТипЗНЧДокумент = Тип("ДокументОбъект.ЗаказНаряд") Тогда
      	ЧастьНаименования = "Заказ-наряд";		
		НовДог.ДляАвтосервиса = Истина;		
	Иначе	
		ЧастьНаименования = "";				
 	КонецЕсли;
 	НовДог.Наименование = СокрЛП(ЧастьНаименования+" № "+СокрЛП(НовДог.НомерДоговора)+" от "+Формат(НовДог.ДатаНачала,"ДЛФ=D")); 
	НовДог.Автор = ПараметрыСеанса.Пользователь;
	НовДог.ДатаСоздания = ТекущаяДата();
	НовДог.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
	НовДог.Комментарий = "Договор создан автоматически пользователем: "+ПараметрыСеанса.Пользователь+" "+Формат(ТекущаяДата(),"ДЛФ=DDT");
	НовДог.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	Попытка
		НовДог.Записать();
		#Если Клиент Тогда 
		//Сообщить("Создан новый договор "+НовДог);
		#КонецЕсли
	Исключение
		#Если Клиент Тогда 
			Сообщить("ОШИБКА! Не удалось создать новый договор.",СтатусСообщения.ОченьВажное);	
		#КонецЕсли
 		Форма = НовДог.ПолучитьФорму("ФормаЭлемента");
		Если Не Форма.Открыта() Тогда
			Попытка Форма.ОткрытьМодально(); Исключение КонецПопытки;
 		КонецЕсли;
 	КонецПопытки; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НовДог.Ссылка;

КонецФункции // СоздатьДоговор(ТекКонтрагент,ТекОрганизация,ТекПодразделениеКомпании,ТекНомер,ТекДата,ТекТипЗНЧДокумент)
//Бондаренко-- 20210923 

//Бондаренко++ 20220519
Процедура СМГ_ОбновитьДоговор(ТекДог,ТекНомер,ТекДата,ТекТипЗНЧДокумент) Экспорт

  	
	Если СокрЛП(ТекДог.НомерДоговора) <> СокрЛП(ТекНомер) Тогда

		УстановитьПривилегированныйРежим(Истина);                	
 		
 		ТекДог.НомерДоговора = СокрЛП(ТекНомер);	
		ТекДог.ДатаНачала = ТекДата;
 		
		Если ТекТипЗНЧДокумент = Тип("ДокументОбъект.ЗаказНаАвтомобиль") Тогда
  			ЧастьНаименования = "Договор продажи транспортного средства";
		ИначеЕсли ТекТипЗНЧДокумент = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
 			ЧастьНаименования = "Договор продажи";		
		ИначеЕсли ТекТипЗНЧДокумент = Тип("ДокументОбъект.ЗаказНаряд") Тогда
 			ЧастьНаименования = "Заказ-наряд";		
		Иначе	
			ЧастьНаименования = "";				
		КонецЕсли;

		ТекДог.Наименование = СокрЛП(ЧастьНаименования+" № "+СокрЛП(ТекДог.НомерДоговора)+" от "+Формат(ТекДог.ДатаНачала,"ДЛФ=D")); 
		ТекДог.Автор = ПараметрыСеанса.Пользователь;
		ТекДог.ДатаСоздания = ТекущаяДата();
		ТекДог.Комментарий = "Договор обновлён автоматически пользователем: "+ПараметрыСеанса.Пользователь+" "+Формат(ТекущаяДата(),"ДЛФ=DDT");
 		
 		Попытка
			ТекДог.Записать();
			#Если Клиент Тогда 
				//Сообщить("Обновлён договор "+ТекДог);
			#КонецЕсли
		Исключение
			#Если Клиент Тогда 
				Сообщить("ОШИБКА! Не удалось обновить договор.",СтатусСообщения.ОченьВажное);	
			#КонецЕсли
		КонецПопытки; 
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры // СМГ_ОбновитьДоговор(ДокументИсточник)
//Бондаренко++ 20220519
